app/controllers/api/v1/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Book.find(params[:id]), serializer: BookShowSerializer