app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @books = Book.paginate(page: params[:page], per_page: 10)